app/Controllers/laporan.php

SELECT *
FROM `anak`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `anak`
---
    public function index()
    {
    	$model = new Laporan_model();
        $data['getAnak'] = $model->getAnak();
        $data['title'] = 'Data Anak';
        $kunci = $this->request->getVar('cari');
        echo view('header_view', $data);


        if ($kunci) {
            $query = $model->cari($kunci);
        } else {
            $query = $model;
        }
        $data['anak'] = $query->paginate(10);