app/Models/imunisasi_model.php

SELECT *
FROM `anak`
---
    public function getAnak($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id_anak' => $id]);