app/Models/timbang_model.php

    public function getAnak($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id_anak' => $id]);
---
SELECT *
FROM `anak`
WHERE `id_anak` = '2'

    public function edit($data,$id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_anak', $id);
        return $builder->update($data);
---
UPDATE `anak` SET `nama_anak` = 'rafki', `tanggal_lahir` = '2020-01-03', `jk` = 'l', `bb` = '12', `tb` = '90', `tgl_timbang` = '2022-07-01'
WHERE `id_anak` = '6'